In [1]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder , MinMaxScaler , StandardScaler

In [2]:
data = pd.read_csv("D:\\titanic_seaborn.csv")
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
data.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [4]:
data.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [5]:
data['age'].fillna(data['age'].median() , inplace = True)

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_19708\4063506822.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['age'].fillna(data['age'].median() , inplace = True)

In [6]:

data['deck'].fillna('Unknown' , inplace = True)

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_19708\3788977770.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['deck'].fillna('Unknown' , inplace = True)

In [7]:
data = data.dropna()

In [8]:
data['age'] = data['age'].astype(int)

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_19708\3403544981.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['age'] = data['age'].astype(int)

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 889 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     889 non-null    int64
 1   pclass       889 non-null    int64
 2   sex          889 non-null    object
 3   age          889 non-null    int64
 4   sibsp        889 non-null    int64
 5   parch        889 non-null    int64
 6   fare         889 non-null    float64
 7   embarked     889 non-null    object
 8   class        889 non-null    object
 9   who          889 non-null    object
 10  adult_male   889 non-null    bool
 11  deck         889 non-null    object
 12  embark_town  889 non-null    object
 13  alive        889 non-null    object
 14  alone        889 non-null    bool
dtypes: bool(2), float64(1), int64(5), object(7)
memory usage: 99.0+ KB

In [10]:
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22,1,0,7.2500,S,Third,man,True,Unknown,Southampton,no,False
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,Unknown,Southampton,yes,True
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35,0,0,8.0500,S,Third,man,True,Unknown,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27,0,0,13.0000,S,Second,man,True,Unknown,Southampton,no,True
887,1,1,female,19,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,28,1,2,23.4500,S,Third,woman,False,Unknown,Southampton,no,False
889,1,1,male,26,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32,0,0,7.7500,Q,Third,man,True,Unknown,Queenstown,no,True

In [11]:
m = MinMaxScaler()
data['normalized_age'] = m.fit_transform(data[['age']])

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_19708\4112272212.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['normalized_age'] = m.fit_transform(data[['age']])

In [12]:
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,normalized_age
0,0,3,male,22,1,0,7.2500,S,Third,man,True,Unknown,Southampton,no,False,0.2750
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0.4750
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,Unknown,Southampton,yes,True,0.3250
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0.4375
4,0,3,male,35,0,0,8.0500,S,Third,man,True,Unknown,Southampton,no,True,0.4375
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27,0,0,13.0000,S,Second,man,True,Unknown,Southampton,no,True,0.3375
887,1,1,female,19,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0.2375
888,0,3,female,28,1,2,23.4500,S,Third,woman,False,Unknown,Southampton,no,False,0.3500
889,1,1,male,26,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0.3250
890,0,3,male,32,0,0,7.7500,Q,Third,man,True,Unknown,Queenstown,no,True,0.4000

In [13]:
data.drop(columns = ['who' , 'adult_male'] , inplace = True)

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_19708\3474433362.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.drop(columns = ['who' , 'adult_male'] , inplace = True)

In [14]:
l = LabelEncoder()
data['sex_encoded'] = l.fit_transform(data['sex'])

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_19708\2900981925.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['sex_encoded'] = l.fit_transform(data['sex'])

In [15]:
data = pd.get_dummies(data , columns = ['embark_town'])

In [16]:
s = MinMaxScaler()
data['normalized_fare'] = s.fit_transform(data[['fare']])

In [17]:
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,alive,alone,normalized_age,sex_encoded,embark_town_Cherbourg,embark_town_Queenstown,embark_town_Southampton,normalized_fare
0,0,3,male,22,1,0,7.2500,S,Third,Unknown,no,False,0.2750,1,False,False,True,0.014151
1,1,1,female,38,1,0,71.2833,C,First,C,yes,False,0.4750,0,True,False,False,0.139136
2,1,3,female,26,0,0,7.9250,S,Third,Unknown,yes,True,0.3250,0,False,False,True,0.015469
3,1,1,female,35,1,0,53.1000,S,First,C,yes,False,0.4375,0,False,False,True,0.103644
4,0,3,male,35,0,0,8.0500,S,Third,Unknown,no,True,0.4375,1,False,False,True,0.015713
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27,0,0,13.0000,S,Second,Unknown,no,True,0.3375,1,False,False,True,0.025374
887,1,1,female,19,0,0,30.0000,S,First,B,yes,True,0.2375,0,False,False,True,0.058556
888,0,3,female,28,1,2,23.4500,S,Third,Unknown,no,False,0.3500,0,False,False,True,0.045771
889,1,1,male,26,0,0,30.0000,C,First,C,yes,True,0.3250,1,True,False,False,0.058556
890,0,3,male,32,0,0,7.7500,Q,Third,Unknown,no,True,0.4000,1,False,True,False,0.015127

In [20]:
data.to_csv("D:\\ Titanic_Dataset.csv", index = False)